examples/mhdChtMultiRegionInterIsoFoam_mod/Allrun.pre
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

rm log.*

runApplication blockMesh
runApplication topoSet

# Restore initial fields
restore0Dir

runApplication splitMeshRegions -cellZones -overwrite

# Remove fluid fields from solid regions (important for post-processing)
for region in $(foamListRegions solid)
do
    rm -f 0/$region/{nut,alphat,epsilon,k,U,p_rgh,alpha.metal,JxB,omega}
    rm -f processor*/0/$region/{nut,alphat,epsilon,k,U,p_rgh,JxB,alpha.metal,omega}
done

for region in $(foamListRegions)
do
    runApplication -s $region changeDictionary -region $region
done

echo
echo "Use paraFoam -touch-all to create files for paraview post-processing"
echo
echo "End"


paraFoam -touch-all 
#------------------------------------------------------------------------------
