examples/mhdChtMultiRegionInterIsoFoam_mod/constant/mixture/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/mixture";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
simulationType  RAS; // laminar // RAS // LES

RAS
{
    RASModel        RNGkEpsilon;//RNGkEpsilon, kOmegaSST,kEpsilon;

    turbulence      on;

    printCoeffs     on;
}


// ************************************************************************* //
