examples/mhdChtMultiRegionInterIsoFoam_mod/system/cpad
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      cpad;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

reportFileName      "cpa.txt";  // filename suffix
targetPhase         1;          // alpha1
alphaMinThreshold   0.99;        // min. threshold for continuous area detection
detectOver          "edges";    // continuous area detection over: "faces" "edges" or 
                                // "points"

