examples/mhdChtMultiRegionInterIsoFoam_mod/system/mixture/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/mixture";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         cellLimited leastSquares 1.0;
}

divSchemes
{
    div(rhoPhi,U)       Gauss linearUpwind grad(U); 
    div(phi,alpha)      Gauss vanLeer;
    div(phirb,alpha)    Gauss linear;

    div(rhoPhi,T)       Gauss linear; 
    div(rhoPhi,K)       Gauss linear; 
    div(phi,p)          Gauss linear; 
    div(phi,rho)          Gauss linear; 
    div(phi,thermo:rho.metal)          Gauss linear; 
    div(phi,thermo:rho.slag)          Gauss linear; 

    div(phi,k)          Gauss upwind; 
    div(phi,omega)      Gauss upwind;
    div(phi,epsilon)    Gauss upwind;
    div(rhoPhi,k)       Gauss upwind;
    div(rhoPhi,omega)   Gauss upwind;
    div(rhoPhi,epsilon) Gauss upwind;

    div(((rho*nuEff)*dev2(T(grad(U)))))     Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
	elcond          cellPoint;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method meshWave;
}

// ************************************************************************* //
