examples/mhdChtMultiRegionInterIsoFoam_mod/system/skin/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/mould";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    h
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-07;
        relTol           0.001;
    }

    hFinal
    {
        $h;
        tolerance        1e-07;
        relTol           0;
    }
}

PIMPLE
{
    nNonOrthogonalCorrectors 1;

        
    residualControl
    {
        h
        {
                tolerance  1e-6;
                relTol      0;
        }
    }
}

// ************************************************************************* //